Revit 2024 API
BuiltInFailures.RebarShapeFailures.CircleUnbounded Property
 An unbounded circle can only be used to construct a spiral shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircleUnbounded { get; }
Visual Basic
Public Shared ReadOnly Property CircleUnbounded As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircleUnbounded {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace